app/controllers/materials_controller.rb

SELECT "materials".* FROM "materials" WHERE "materials"."deleted_at" IS NULL
---
  def index
    @materials = Material.all

INSERT INTO "materials" ("name", "display_order", "deleted_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "鉄"], ["display_order", 2], ["deleted_at", nil], ["created_at", "2026-07-27 17:24:00.044873"], ["updated_at", "2026-07-27 17:24:00.044873"]]
---
  def create
    @material = Material.new(material_params)
    if @material.save

UPDATE "materials" SET "name" = ?, "updated_at" = ? WHERE "materials"."id" = ?  [["name", "プラスチック2"], ["updated_at", "2026-07-26 16:25:40.479315"], ["id", 1]]
---
  def update
    if @material.update(material_params)

SELECT "materials".* FROM "materials" WHERE "materials"."deleted_at" IS NULL AND "materials"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_material
    @material = Material.find(params[:id])