app/controllers/sessions_controller.rb

  def create
    staff = Staff.find_by(login_id: params[:login_id])
---
SELECT "staffs".* FROM "staffs" WHERE "staffs"."login_id" = ? LIMIT ?  [["login_id", "admin"], ["LIMIT", 1]]